# Space_CountAssignedZones

## Description
Returns count of assigned zones of the space object

```pascal
FUNCTION Space_CountAssignedZones(space : HANDLE): INTEGER;
```

```python
def vs.Space_CountAssignedZones(space):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools